package org.DenWorker.Java_Core._2_OOP._2_4_Inheritance_and_Polymorphism;

public class Task_2_4_2 {
    public static void main(String[] args) {
        System.out.println("Метод производного класса должен иметь в точности тот же набор параметров, что и метод базового класса.");
        System.out.println("Метод базового класса должен быть виден в производном классе.");
        System.out.println("Тип, возвращаемый методом производного класса, должен совпадать или быть подклассом типа, возвращаемого методом базового класса.");
        System.out.println("Метод производного класса должен иметь модификатор доступа, такой же или более открытый, чем метод базового класса.");
    }
}
